etelvra/STM32F103C8T6/_Time/IC.c
#include "stm32f10x.h"                  // Device header

void IC_Init(void)
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	TIM_InternalClockConfig(TIM3);
	
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 65536 - 1;		//ARR                   //ARR的值越大越好
	TIM_TimeBaseInitStructure.TIM_Prescaler = 72 - 1;		//PSC                   //1MHz
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseInitStructure);
	
	TIM_ICInitTypeDef TIM_ICInitStructure;
	TIM_ICInitStructure.TIM_Channel = TIM_Channel_1;                                //选择通道
	TIM_ICInitStructure.TIM_ICFilter = 0xF;                                         //配置输入捕获滤波器0x0~0xF
	TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;                     //边沿检测极性选择，上升沿
	TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;                           //配置输入比较的分频器
	TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;                 //选择触发信号从哪个引脚输入，直连通道or交叉通道
	TIM_ICInit(TIM3, &TIM_ICInitStructure);
//	TIM_PWMIConfig(TIM3, &TIM_ICInitStructure);                                     //封装的双通道IC，自动对另一通道取反

	TIM_SelectInputTrigger(TIM3, TIM_TS_TI1FP1);                                    //触发源选择
	TIM_SelectSlaveMode(TIM3, TIM_SlaveMode_Reset);                                 //从模式
	
	TIM_Cmd(TIM3, ENABLE);
}

uint32_t IC_GetFreq(void)                                                           //获取频率
{
	return 1000000 / (TIM_GetCapture1(TIM3) + 1);
}

uint32_t IC_GetDuty(void)                                                           //获取占空比
{
	return (TIM_GetCapture2(TIM3) + 1) * 100 / (TIM_GetCapture1(TIM3) + 1);
}
